# MITHA AMALIA

## 2009106028

### Kecerdasan Buatan A2 2020

# Import

In [57]:
import pandas as pd
from tabulate import tabulate

# Read Data

In [58]:
data = pd.read_csv("income_threshold.csv")
data.head()

,age,workclass,fnlwgt,education,education.num,maritalStatus,occupation,relationship,race,sex,capitalGain,capitalLoss,hoursPerWeek,nativeCountry,income
0,82,Private,132870,HS-grad,9,Widowed,Exec-managerial,Not-in-family,White,Female,0,4356,18,United-States,<=50K
1,54,Private,140359,7th-8th,4,Divorced,Machine-op-inspct,Unmarried,White,Female,0,3900,40,United-States,<=50K
2,41,Private,264663,Some-college,10,Separated,Prof-specialty,Own-child,White,Female,0,3900,40,United-States,<=50K
3,34,Private,216864,HS-grad,9,Divorced,Other-service,Unmarried,White,Female,0,3770,45,United-States,<=50K
4,38,Private,150601,10th,6,Separated,Adm-clerical,Unmarried,White,Male,0,3770,40,United-States,<=50K

## Melihat Jumlah Baris dan Kolom

In [59]:
data.shape

(30162, 15)

## Melihat Tipe Data tiap Atribut

In [60]:
data.dtypes

age               int64
workclass        object
fnlwgt            int64
education        object
education.num     int64
maritalStatus    object
occupation       object
relationship     object
race             object
sex              object
capitalGain       int64
capitalLoss       int64
hoursPerWeek      int64
nativeCountry    object
income           object
dtype: object

## Melihat Jumlah Record, Nama Attribute, Jumlah Attribute dengan Tipe Objek, Jumlah Attribute dengan Tipe Angka, Jumlah Attribute yang memiliki nilai NULL.

In [61]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30162 entries, 0 to 30161
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            30162 non-null  int64
 1   workclass      30162 non-null  object
 2   fnlwgt         30162 non-null  int64
 3   education      30162 non-null  object
 4   education.num  30162 non-null  int64
 5   maritalStatus  30162 non-null  object
 6   occupation     30162 non-null  object
 7   relationship   30162 non-null  object
 8   race           30162 non-null  object
 9   sex            30162 non-null  object
 10  capitalGain    30162 non-null  int64
 11  capitalLoss    30162 non-null  int64
 12  hoursPerWeek   30162 non-null  int64
 13  nativeCountry  30162 non-null  object
 14  income         30162 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.5+ MB

## Mencari Nilai NULL

In [62]:
data.isnull().any().sum()

0

## Menampilkan Info diatas dengan Dictionary

In [63]:
#Jumlah Record
jml = len(data)

In [64]:
atr = list(data.columns)
atr = "\n".join(atr)

In [65]:
#jumlah atribut tipe object
obj = len(data.dtypes[data.dtypes == 'object'])

In [66]:
#jumlah atribut tipe angka
num = len(data.dtypes[data.dtypes == 'int64'])
num1 = len(data.dtypes[data.dtypes == 'float64'])

In [67]:
#jumlah atribut nilai null
nul = data.isna().any().sum()

In [68]:
dictionary = {
    "Jumlah Record" : [jml],
    "Atribut":[atr],
    "Jumlah Tipe Object" : [obj],
    "Jumlah Tipe Integer" : [num],
    "Jumlah Tipe Float" : [num1],
    "Jumlah Nilai NULL" : [nul],

}

In [69]:
tabel = pd.DataFrame(dictionary)
print(tabulate(tabel, headers='keys', tablefmt='psql', showindex=False))

+-----------------+---------------+----------------------+-----------------------+---------------------+---------------------+
|   Jumlah Record | Atribut       |   Jumlah Tipe Object |   Jumlah Tipe Integer |   Jumlah Tipe Float |   Jumlah Nilai NULL |
|-----------------+---------------+----------------------+-----------------------+---------------------+---------------------|
|           30162 | age           |                    9 |                     6 |                   0 |                   0 |
|                 | workclass     |                      |                       |                     |                     |
|                 | fnlwgt        |                      |                       |                     |                     |
|                 | education     |                      |                       |                     |                     |
|                 | education.num |                      |                       |                     |                     |
|                 | maritalStatus |                      |                       |                     |                     |
|                 | occupation    |                      |                       |                     |                     |
|                 | relationship  |                      |                       |                     |                     |
|                 | race          |                      |                       |                     |                     |
|                 | sex           |                      |                       |                     |                     |
|                 | capitalGain   |                      |                       |                     |                     |
|                 | capitalLoss   |                      |                       |                     |                     |
|                 | hoursPerWeek  |                      |                       |                     |                     |
|                 | nativeCountry |                      |                       |                     |                     |
|                 | income        |                      |                       |                     |                     |
+-----------------+---------------+----------------------+-----------------------+---------------------+---------------------+

## Menghitung rata-rata(mean), Standar deviasi(std), nilai maksimal(max), nilai minimum(min), Q1(25%), Q2(50%), Q3(75%)

In [70]:
data.describe()

,age,fnlwgt,education.num,capitalGain,capitalLoss,hoursPerWeek
count,30162.000000,3.016200e+04,30162.000000,30162.000000,30162.000000,30162.000000
mean,38.437902,1.897938e+05,10.121312,1092.007858,88.372489,40.931238
std,13.134665,1.056530e+05,2.549995,7406.346497,404.298370,11.979984
min,17.000000,1.376900e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.176272e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.784250e+05,10.000000,0.000000,0.000000,40.000000
75%,47.000000,2.376285e+05,13.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

## Menampilkan Korelasi

In [71]:
data.corr()

,age,fnlwgt,education.num,capitalGain,capitalLoss,hoursPerWeek
age,1.000000,-0.076511,0.043526,0.080154,0.060165,0.101599
fnlwgt,-0.076511,1.000000,-0.044992,0.000422,-0.009750,-0.022886
education.num,0.043526,-0.044992,1.000000,0.124416,0.079646,0.152522
capitalGain,0.080154,0.000422,0.124416,1.000000,-0.032229,0.080432
capitalLoss,0.060165,-0.009750,0.079646,-0.032229,1.000000,0.052417
hoursPerWeek,0.101599,-0.022886,0.152522,0.080432,0.052417,1.000000

## Mengubah tipe int menjadi float pada atribut tipe angka

In [72]:
data["education.num"].head()

0     9
1     4
2    10
3     9
4     6
Name: education.num, dtype: int64

In [73]:
data["education.num"] = data["education.num"]*0.001

In [74]:
data["education.num"].head()

0    0.009
1    0.004
2    0.010
3    0.009
4    0.006
Name: education.num, dtype: float64

## Menampilkan 10 Record Pertama dari atribut bertipe angka

In [75]:
data.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education.num    float64
maritalStatus     object
occupation        object
relationship      object
race              object
sex               object
capitalGain        int64
capitalLoss        int64
hoursPerWeek       int64
nativeCountry     object
income            object
dtype: object

In [76]:
dataAngka = pd.DataFrame()
for i in data.columns:
    if(data[i].dtypes == "int64" or data[i].dtypes == "float64"):
        dataAngka[i] = data[i]

In [77]:
dataAngka.dtypes

age                int64
fnlwgt             int64
education.num    float64
capitalGain        int64
capitalLoss        int64
hoursPerWeek       int64
dtype: object

In [78]:
dataAngka.head(10)

   age  fnlwgt  education.num  capitalGain  capitalLoss  hoursPerWeek
0   82  132870          0.009            0         4356            18
1   54  140359          0.004            0         3900            40
2   41  264663          0.010            0         3900            40
3   34  216864          0.009            0         3770            45
4   38  150601          0.006            0         3770            40
5   74   88638          0.016            0         3683            20
6   68  422013          0.009            0         3683            40
7   45  172274          0.016            0         3004            35
8   38  164526          0.015            0         2824            45
9   52  129177          0.013            0         2824            20

## Menyimpan dataset dengan attribute bertipe angka ke dalam file CSV

In [79]:
dataAngka.to_csv("DatasetTipe_Angka.csv")